### Dataframes

### Semelhante ao Excel - tabelas

In [35]:
import pandas as pd
import numpy as np

In [36]:
from numpy.random import randn
np.random.seed(50)

In [37]:
df = pd.DataFrame(randn(5,4), index = 'A B C D E'.split(), columns = 'W X Y Z'.split())

In [38]:
df

          W         X         Y         Z
A -1.560352 -0.030978 -0.620928 -1.464580
B  1.411946 -0.476732 -0.780469  1.070268
C -1.282293 -1.327479  0.126338  0.862194
D  0.696737 -0.334565 -0.997526  1.598908
E  3.314075  0.987770  0.123866  0.742785

### Seleção e Indexação

In [39]:
df['W']

A   -1.560352
B    1.411946
C   -1.282293
D    0.696737
E    3.314075
Name: W, dtype: float64

In [40]:
df[['W', 'Z']]

          W         Z
A -1.560352 -1.464580
B  1.411946  1.070268
C -1.282293  0.862194
D  0.696737  1.598908
E  3.314075  0.742785

In [41]:
df.W

A   -1.560352
B    1.411946
C   -1.282293
D    0.696737
E    3.314075
Name: W, dtype: float64

In [42]:
df

          W         X         Y         Z
A -1.560352 -0.030978 -0.620928 -1.464580
B  1.411946 -0.476732 -0.780469  1.070268
C -1.282293 -1.327479  0.126338  0.862194
D  0.696737 -0.334565 -0.997526  1.598908
E  3.314075  0.987770  0.123866  0.742785

In [43]:
df['Novo'] = df['W'] - df['X']

In [44]:
df

          W         X         Y         Z      Novo
A -1.560352 -0.030978 -0.620928 -1.464580 -1.529375
B  1.411946 -0.476732 -0.780469  1.070268  1.888678
C -1.282293 -1.327479  0.126338  0.862194  0.045186
D  0.696737 -0.334565 -0.997526  1.598908  1.031302
E  3.314075  0.987770  0.123866  0.742785  2.326305

In [45]:
df.drop('Novo', axis = 1)

          W         X         Y         Z
A -1.560352 -0.030978 -0.620928 -1.464580
B  1.411946 -0.476732 -0.780469  1.070268
C -1.282293 -1.327479  0.126338  0.862194
D  0.696737 -0.334565 -0.997526  1.598908
E  3.314075  0.987770  0.123866  0.742785

In [46]:
df

          W         X         Y         Z      Novo
A -1.560352 -0.030978 -0.620928 -1.464580 -1.529375
B  1.411946 -0.476732 -0.780469  1.070268  1.888678
C -1.282293 -1.327479  0.126338  0.862194  0.045186
D  0.696737 -0.334565 -0.997526  1.598908  1.031302
E  3.314075  0.987770  0.123866  0.742785  2.326305

In [47]:
df.drop('Novo', axis = 1, inplace = True)

In [48]:
df

          W         X         Y         Z
A -1.560352 -0.030978 -0.620928 -1.464580
B  1.411946 -0.476732 -0.780469  1.070268
C -1.282293 -1.327479  0.126338  0.862194
D  0.696737 -0.334565 -0.997526  1.598908
E  3.314075  0.987770  0.123866  0.742785

In [49]:
df.drop('C', axis = 0)

          W         X         Y         Z
A -1.560352 -0.030978 -0.620928 -1.464580
B  1.411946 -0.476732 -0.780469  1.070268
D  0.696737 -0.334565 -0.997526  1.598908
E  3.314075  0.987770  0.123866  0.742785

In [50]:
df.loc['B']

W    1.411946
X   -0.476732
Y   -0.780469
Z    1.070268
Name: B, dtype: float64

In [51]:
df.iloc[2]

W   -1.282293
X   -1.327479
Y    0.126338
Z    0.862194
Name: C, dtype: float64

In [52]:
df.loc['D', 'X']

-0.3345651848953687

In [53]:
df.loc[['A', 'B', 'C'], ['X', 'Y']]

          X         Y
A -0.030978 -0.620928
B -0.476732 -0.780469
C -1.327479  0.126338

### Seleção condicional

In [54]:
df

          W         X         Y         Z
A -1.560352 -0.030978 -0.620928 -1.464580
B  1.411946 -0.476732 -0.780469  1.070268
C -1.282293 -1.327479  0.126338  0.862194
D  0.696737 -0.334565 -0.997526  1.598908
E  3.314075  0.987770  0.123866  0.742785

In [55]:
df > 0

       W      X      Y      Z
A  False  False  False  False
B   True  False  False   True
C  False  False   True   True
D   True  False  False   True
E   True   True   True   True

In [56]:
df[df > 0]

          W        X         Y         Z
A       NaN      NaN       NaN       NaN
B  1.411946      NaN       NaN  1.070268
C       NaN      NaN  0.126338  0.862194
D  0.696737      NaN       NaN  1.598908
E  3.314075  0.98777  0.123866  0.742785

In [57]:
df[df['X'] > 0]

          W        X         Y         Z
E  3.314075  0.98777  0.123866  0.742785

In [58]:
df[(df['W'] > 0) & (df['Z'] > 1)]

          W         X         Y         Z
B  1.411946 -0.476732 -0.780469  1.070268
D  0.696737 -0.334565 -0.997526  1.598908